In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [5]:
## Missing data

stringData = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
stringData
stringData.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
## Removing missing data
from numpy import nan as NAN
data = pd.Series([1, NAN, 3.5, NAN, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NAN, NAN], [NAN, NAN, NAN], [NAN, 6.5, 3.]])

cleaned = data.dropna()
print(data)
print(cleaned)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0
     0    1    2
0  1.0  6.5  3.0

In [10]:
data[4] = NAN
data
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NAN
df.iloc[:2, 2] = NAN
df

          0         1         2
0  0.272767       NaN       NaN
1  0.119812       NaN       NaN
2  0.152799       NaN -0.303150
3  1.250145       NaN -0.078938
4  0.276704  0.368738 -0.307407
5 -1.063163  0.272869 -1.252454
6 -1.882835 -0.110003  0.332950

In [13]:
df.dropna()
df.dropna(thresh=2)

          0         1         2
2  0.152799       NaN -0.303150
3  1.250145       NaN -0.078938
4  0.276704  0.368738 -0.307407
5 -1.063163  0.272869 -1.252454
6 -1.882835 -0.110003  0.332950